# <h1><center>SHARK ATTACKS</center></h1>
## <h1><center>Data Cleaning Project using pandas</center></h1>

![shark_attack](images/shark_attack.jpg)

Importing the libraries

In [1]:
import pandas as pd
import numpy as np
import re

Importing the CSV. You have to use the "engine = 'python'"

In [2]:
df = pd.read_csv('data/GSAF5.csv', sep=',', engine='python')

Take a look in the dataset

In [3]:
df.head()

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
0,2016.09.18.c,18-Sep-16,2016,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Surfing,male,M,...,NaN,"Orlando Sentinel, 9/19/2016",2016.09.18.c-NSB.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.18.c,2016.09.18.c,5993,NaN,NaN
1,2016.09.18.b,18-Sep-16,2016,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Surfing,Chucky Luciano,M,...,NaN,"Orlando Sentinel, 9/19/2016",2016.09.18.b-Luciano.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.18.b,2016.09.18.b,5992,NaN,NaN
2,2016.09.18.a,18-Sep-16,2016,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Surfing,male,M,...,NaN,"Orlando Sentinel, 9/19/2016",2016.09.18.a-NSB.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.18.a,2016.09.18.a,5991,NaN,NaN
3,2016.09.17,17-Sep-16,2016,Unprovoked,AUSTRALIA,Victoria,Thirteenth Beach,Surfing,Rory Angiolella,M,...,NaN,"The Age, 9/18/2016",2016.09.17-Angiolella.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.17,2016.09.17,5990,NaN,NaN
4,2016.09.15,16-Sep-16,2016,Unprovoked,AUSTRALIA,Victoria,Bells Beach,Surfing,male,M,...,2 m shark,"The Age, 9/16/2016",2016.09.16-BellsBeach.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.16,2016.09.15,5989,NaN,NaN

Which data types do we have?

In [4]:
df.dtypes

Case Number               object
Date                      object
Year                       int64
Type                      object
Country                   object
Area                      object
Location                  object
Activity                  object
Name                      object
Sex                       object
Age                       object
Injury                    object
Fatal (Y/N)               object
Time                      object
Species                   object
Investigator or Source    object
pdf                       object
href formula              object
href                      object
Case Number.1             object
Case Number.2             object
original order             int64
Unnamed: 22               object
Unnamed: 23               object
dtype: object

Which columns are relevant for me?

In [5]:
null_columns = df.isna().sum()
null_columns[null_columns.gt(0)]

Country                     43
Area                       402
Location                   496
Activity                   527
Name                       200
Sex                        567
Age                       2681
Injury                      27
Fatal (Y/N)                 19
Time                      3213
Species                   2934
Investigator or Source      15
href formula                 1
href                         3
Unnamed: 22               5991
Unnamed: 23               5990
dtype: int64

In [6]:
null_columns[null_columns.gt(0)] / len(df)

Country                   0.007176
Area                      0.067089
Location                  0.082777
Activity                  0.087951
Name                      0.033378
Sex                       0.094626
Age                       0.447430
Injury                    0.004506
Fatal (Y/N)               0.003171
Time                      0.536215
Species                   0.489653
Investigator or Source    0.002503
href formula              0.000167
href                      0.000501
Unnamed: 22               0.999833
Unnamed: 23               0.999666
dtype: float64

In [7]:
null_prop = null_columns[null_columns.gt(0)] / len(df)

We could now drop some columns which have a high proportion of missing values. 
I will use prop = 0.55 so we still have the time in dataset

In [8]:
null_prop[null_prop.gt(.55)]

Unnamed: 22    0.999833
Unnamed: 23    0.999666
dtype: float64

In [9]:
list(null_prop[null_prop.gt(.55)].index)

['Unnamed: 22', 'Unnamed: 23']

In [10]:
type(list(null_prop[null_prop.gt(.55)].index))

list

In [11]:
df1 = df.drop(columns=null_prop[null_prop.gt(.55)].index)

In [12]:
(df1.isna().sum() / len(df1))[(df1.isna().sum() / len(df1)).gt(0)]

Country                   0.007176
Area                      0.067089
Location                  0.082777
Activity                  0.087951
Name                      0.033378
Sex                       0.094626
Age                       0.447430
Injury                    0.004506
Fatal (Y/N)               0.003171
Time                      0.536215
Species                   0.489653
Investigator or Source    0.002503
href formula              0.000167
href                      0.000501
dtype: float64

Check the columns again:

In [13]:
df1.dtypes

Case Number               object
Date                      object
Year                       int64
Type                      object
Country                   object
Area                      object
Location                  object
Activity                  object
Name                      object
Sex                       object
Age                       object
Injury                    object
Fatal (Y/N)               object
Time                      object
Species                   object
Investigator or Source    object
pdf                       object
href formula              object
href                      object
Case Number.1             object
Case Number.2             object
original order             int64
dtype: object

We may also don't need some other columns with non-relevant information. If we think they are somehow relevant, we can change it back :)

In [14]:
df2 = df1.drop(columns=['pdf', 'href formula', 'href',
       'Case Number.1', 'Case Number.2'])

The column names are not clean and the 'original order' seems to be a kind of unique ID. 
So we rename them.

In [15]:
df2.columns

Index(['Case Number', 'Date', 'Year', 'Type', 'Country', 'Area', 'Location',
       'Activity', 'Name', 'Sex ', 'Age', 'Injury', 'Fatal (Y/N)', 'Time',
       'Species ', 'Investigator or Source', 'original order'],
      dtype='object')

In [16]:
df2.rename(columns={'Sex ': 'Sex', 'Species ': 'Species', 'Fatal (Y/N)': 'Fatal', 'original order': 'ID'}, inplace=True)

Now that we have only relevant and clean column names, we can have a look into the values.
We pick first the 'Sex' columns which looks already good.

In [17]:
df2["Sex"].value_counts()

M      4835
F       585
M         2
lli       1
.         1
N         1
Name: Sex, dtype: int64

We can merge some values and name the n/a as NaNs

In [18]:
(df2["Sex"]
 .str.replace("M ", "M")
 .str.replace("N", "NaN")
 .str.replace("lli", "NaN")
 .str.replace(".", "NaN")
 .str.replace(" M", "M")).value_counts()

M      4837
F       585
NaN       3
Name: Sex, dtype: int64

Do we have duplicates?

In [19]:
duplicateRowsDF = df2[df2.duplicated()]

In [20]:
duplicateRowsDF

Empty DataFrame
Columns: [Case Number, Date, Year, Type, Country, Area, Location, Activity, Name, Sex, Age, Injury, Fatal, Time, Species, Investigator or Source, ID]
Index: []

It seems we don't have any duplicates! We may check it later again.

Transform 'Date' into datetime

In [21]:
df2['Date'] = pd.to_datetime(df2['Date'], errors= 'coerce')

In [22]:
df2['Date'].isna().sum()

857

In [23]:
df3 = df2

In [24]:
df3.dtypes

Case Number                       object
Date                      datetime64[ns]
Year                               int64
Type                              object
Country                           object
Area                              object
Location                          object
Activity                          object
Name                              object
Sex                               object
Age                               object
Injury                            object
Fatal                             object
Time                              object
Species                           object
Investigator or Source            object
ID                                 int64
dtype: object

In [25]:
df3["Fatal"].value_counts()

N          4315
Y          1552
UNKNOWN      94
 N            8
N             1
F             1
#VALUE!       1
n             1
Name: Fatal, dtype: int64

In [26]:
(df3["Fatal"]
 .str.replace(" N ", "N")
 .str.replace("F", "Y")
 .str.replace("#VALUE!", "NaN")
 .str.replace("UNKNOWN", "NaN")
 .str.replace("n", "N")
 .str.replace(" N", "N")
 .str.replace("N ", "N")).value_counts()

N      4325
Y      1553
NaN      95
Name: Fatal, dtype: int64

Have a look into the dataset:

In [27]:
df3

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Injury,Fatal,Time,Species,Investigator or Source,ID
0,2016.09.18.c,2016-09-18,2016,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Surfing,male,M,16,Minor injury to thigh,N,13h00,NaN,"Orlando Sentinel, 9/19/2016",5993
1,2016.09.18.b,2016-09-18,2016,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Surfing,Chucky Luciano,M,36,Lacerations to hands,N,11h00,NaN,"Orlando Sentinel, 9/19/2016",5992
2,2016.09.18.a,2016-09-18,2016,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Surfing,male,M,43,Lacerations to lower leg,N,10h43,NaN,"Orlando Sentinel, 9/19/2016",5991
3,2016.09.17,2016-09-17,2016,Unprovoked,AUSTRALIA,Victoria,Thirteenth Beach,Surfing,Rory Angiolella,M,NaN,Struck by fin on chest & leg,N,NaN,NaN,"The Age, 9/18/2016",5990
4,2016.09.15,2016-09-16,2016,Unprovoked,AUSTRALIA,Victoria,Bells Beach,Surfing,male,M,NaN,No injury: Knocked off board by shark,N,NaN,2 m shark,"The Age, 9/16/2016",5989
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5987,ND.0005,NaT,0,Unprovoked,AUSTRALIA,Western Australia,Roebuck Bay,Diving,male,M,NaN,FATAL,Y,NaN,NaN,"H. Taunton; N. Bartlett, p. 234",6
5988,ND.0004,NaT,0,Unprovoked,AUSTRALIA,Western Australia,NaN,Pearl diving,Ahmun,M,NaN,FATAL,Y,NaN,NaN,"H. Taunton; N. Bartlett, pp. 233-234",5
5989,ND.0003,NaT,0,Unprovoked,USA,North Carolina,Ocracoke Inlet,Swimming,Coast Guard personnel,M,NaN,FATAL,Y,NaN,NaN,"F. Schwartz, p.23; C. Creswell, GSAF",4
5990,ND.0002,NaT,0,Unprovoked,PANAMA,NaN,"Panama Bay 8ºN, 79ºW",NaN,Jules Patterson,M,NaN,FATAL,Y,NaN,NaN,"The Sun, 10/20/1938",3
5991,ND.0001,NaT,0,Unprovoked,CEYLON (SRI LANKA),Eastern Province,"Below the English fort, Trincomalee",Swimming,male,M,15,"FATAL. ""Shark bit him in half, carrying away t...",Y,NaN,NaN,S.W. Baker,2

In [28]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5992 entries, 0 to 5991
Data columns (total 17 columns):
Case Number               5992 non-null object
Date                      5135 non-null datetime64[ns]
Year                      5992 non-null int64
Type                      5992 non-null object
Country                   5949 non-null object
Area                      5590 non-null object
Location                  5496 non-null object
Activity                  5465 non-null object
Name                      5792 non-null object
Sex                       5425 non-null object
Age                       3311 non-null object
Injury                    5965 non-null object
Fatal                     5973 non-null object
Time                      2779 non-null object
Species                   3058 non-null object
Investigator or Source    5977 non-null object
ID                        5992 non-null int64
dtypes: datetime64[ns](1), int64(2), object(14)
memory usage: 795.9+ KB

In [29]:
df3['Country'].unique()

array(['USA', 'AUSTRALIA', 'NEW CALEDONIA', 'REUNION', 'BAHAMAS', 'SPAIN',
       'CHINA', 'JAPAN', 'COLUMBIA', 'SOUTH AFRICA', 'EGYPT',
       'NEW ZEALAND', 'INDONESIA', 'FRENCH POLYNESIA', 'CAPE VERDE',
       'Fiji', 'BRAZIL', 'DOMINICAN REPUBLIC', 'CAYMAN ISLANDS',
       'UNITED ARAB EMIRATES', 'ARUBA', 'MOZAMBIQUE', 'THAILAND', 'FIJI',
       'PUERTO RICO', 'ITALY', 'MEXICO', 'ATLANTIC OCEAN', 'GREECE',
       'MAURITIUS', nan, 'ST. MARTIN', 'FRANCE', 'ECUADOR',
       'PAPUA NEW GUINEA', 'TRINIDAD & TOBAGO', 'KIRIBATI', 'ISRAEL',
       'DIEGO GARCIA', 'TAIWAN', 'JAMAICA', 'PALESTINIAN TERRITORIES',
       'GUAM', 'SEYCHELLES', 'BELIZE', 'PHILIPPINES', 'NIGERIA', 'TONGA',
       'SCOTLAND', 'CANADA', 'CROATIA', 'SAUDI ARABIA', 'CHILE',
       'ANTIGUA', 'KENYA', 'RUSSIA', 'TURKS & CAICOS', 'COSTA RICA',
       'UNITED KINGDOM', 'MALAYSIA', 'UNITED ARAB EMIRATES (UAE)',
       'SAMOA', 'AZORES', 'SOLOMON ISLANDS', 'SOUTH KOREA', 'MALTA',
       'VIETNAM', 'MADAGASCAR', 'PANAMA', 'SOMALIA', 'NEVIS', 'CUBA',
       'ENGLAND', 'BRITISH VIRGIN ISLANDS', 'NORWAY', 'SENEGAL', 'YEMEN',
       'GULF OF ADEN', 'Sierra Leone', 'ST. MAARTIN', 'GRAND CAYMAN',
       'Seychelles', 'LIBERIA', 'VANUATU', 'MEXICO ', 'HONDURAS',
       'VENEZUELA', 'SRI LANKA', ' TONGA', 'URUGUAY', 'INDIA',
       'MICRONESIA', 'CARIBBEAN SEA', 'OKINAWA', 'TANZANIA',
       'MARSHALL ISLANDS', 'EGYPT / ISRAEL', 'NORTHERN ARABIAN SEA',
       'HONG KONG', 'EL SALVADOR', 'ANGOLA', 'BERMUDA', 'MONTENEGRO',
       'IRAN', 'TUNISIA', 'NAMIBIA', 'NORTH ATLANTIC OCEAN', 'PORTUGAL',
       'SOUTH CHINA SEA', 'BANGLADESH', 'PALAU', 'WESTERN SAMOA',
       'PACIFIC OCEAN ', 'BRITISH ISLES', 'GRENADA', 'IRAQ', 'TURKEY',
       'SINGAPORE', 'NEW BRITAIN', 'SUDAN', 'JOHNSTON ISLAND',
       'SOUTH PACIFIC OCEAN', 'NEW GUINEA', 'RED SEA',
       'NORTH PACIFIC OCEAN', 'FEDERATED STATES OF MICRONESIA',
       'MID ATLANTIC OCEAN', 'ADMIRALTY ISLANDS', 'BRITISH WEST INDIES',
       'SOUTH ATLANTIC OCEAN', 'PERSIAN GULF', 'RED SEA / INDIAN OCEAN',
       'PACIFIC OCEAN', 'NORTH SEA', 'NICARAGUA ', 'MALDIVE ISLANDS',
       'AMERICAN SAMOA', 'ANDAMAN / NICOBAR ISLANDAS', 'GABON', 'MAYOTTE',
       'NORTH ATLANTIC OCEAN ', 'THE BALKANS', 'SUDAN?', 'ARGENTINA',
       'MARTINIQUE', 'INDIAN OCEAN', 'GUATEMALA', 'NETHERLANDS ANTILLES',
       'NORTHERN MARIANA ISLANDS', 'IRAN / IRAQ', 'JAVA', 'SIERRA LEONE',
       ' PHILIPPINES', 'NICARAGUA', 'CENTRAL PACIFIC',
       'SOLOMON ISLANDS / VANUATU', 'SOUTHWEST PACIFIC OCEAN',
       'BAY OF BENGAL', 'MID-PACIFC OCEAN', 'SLOVENIA', 'CURACAO',
       'ITALY / CROATIA', 'BARBADOS', 'MONACO', 'GUYANA', 'HAITI',
       'SAN DOMINGO', 'IRELAND', 'KUWAIT', 'LIBYA', 'YEMEN ',
       'MEDITERRANEAN SEA?', 'FALKLAND ISLANDS', 'CRETE', 'CYPRUS',
       'EGYPT ', 'BURMA', 'LEBANON', 'PARAGUAY', 'BRITISH NEW GUINEA',
       'OCEAN', 'GEORGIA', 'SYRIA', 'TUVALU', 'INDIAN OCEAN?', 'GUINEA',
       'EQUATORIAL GUINEA / CAMEROON', 'COOK ISLANDS', 'ALGERIA',
       'Coast of AFRICA', 'TASMAN SEA', 'GHANA', 'St Helena', 'GREENLAND',
       'MEDITERRANEAN SEA', 'SWEDEN', 'ICELAND',
       'Between PORTUGAL & INDIA', 'DJIBOUTI', 'BAHREIN', 'KOREA',
       'RED SEA?', 'ASIA?', 'CEYLON (SRI LANKA)'], dtype=object)

The Country columns is essential to analyse the shark attacks later.

In [30]:
for row in df3['Country']:
    if isinstance(row, str):
        new_row = re.sub('\/.+|\(.+\)|\.|\?', '', row)
        new_row = re.sub('\&', 'and', new_row.strip().lower())
        
        if new_row == 'usa':
            new_row = new_row.replace(new_row, 'united states')
        elif new_row == 'bahamas':
            new_row = new_row.replace(new_row, 'the bahamas')
        elif new_row == 'england' or new_row == 'british isles':
            new_row = new_row.replace(new_row, 'united kingdom')
        elif new_row == 'reunion':
            new_row = new_row.replace(new_row, 'réunion')
        elif new_row == 'okinawa':
            new_row = new_row.replace(new_row, 'japan')
        elif new_row == 'azores':
            new_row = new_row.replace(new_row, 'portugal')
        elif new_row == 'red sea':
            new_row = new_row.replace(new_row, 'egypt')
        elif new_row == 'okinawa':
            new_row = new_row.replace(new_row, 'japan')
        elif new_row == 'columbia':
            new_row = new_row.replace(new_row, 'colombia')
        elif new_row == 'new britain' or new_row == 'new guinea' or new_row == 'british new guinea' or new_row == 'admiralty islands':
            new_row = new_row.replace(new_row, 'papua new guinea')
        
        df3['Country'].replace(row,new_row, inplace=True)
    else:
        df3['Country'].replace(row,np.nan, inplace=True)

In [31]:
df3['Country'].unique()

array(['united states', 'australia', 'new caledonia', 'réunion',
       'the bahamas', 'spain', 'china', 'japan', 'colombia',
       'south africa', 'egypt', 'new zealand', 'indonesia',
       'french polynesia', 'cape verde', 'fiji', 'brazil',
       'dominican republic', 'cayman islands', 'united arab emirates',
       'aruba', 'mozambique', 'thailand', 'puerto rico', 'italy',
       'mexico', 'atlantic ocean', 'greece', 'mauritius', nan,
       'st martin', 'france', 'ecuador', 'papua new guinea',
       'trinidad and tobago', 'kiribati', 'israel', 'diego garcia',
       'taiwan', 'jamaica', 'palestinian territories', 'guam',
       'seychelles', 'belize', 'philippines', 'nigeria', 'tonga',
       'scotland', 'canada', 'croatia', 'saudi arabia', 'chile',
       'antigua', 'kenya', 'russia', 'turks and caicos', 'costa rica',
       'united kingdom', 'malaysia', 'samoa', 'portugal',
       'solomon islands', 'south korea', 'malta', 'vietnam', 'madagascar',
       'panama', 'somalia', 'nevis', 'cuba', 'british virgin islands',
       'norway', 'senegal', 'yemen', 'gulf of aden', 'sierra leone',
       'st maartin', 'grand cayman', 'liberia', 'vanuatu', 'honduras',
       'venezuela', 'sri lanka', 'uruguay', 'india', 'micronesia',
       'caribbean sea', 'tanzania', 'marshall islands',
       'northern arabian sea', 'hong kong', 'el salvador', 'angola',
       'bermuda', 'montenegro', 'iran', 'tunisia', 'namibia',
       'north atlantic ocean', 'south china sea', 'bangladesh', 'palau',
       'western samoa', 'pacific ocean', 'grenada', 'iraq', 'turkey',
       'singapore', 'sudan', 'johnston island', 'south pacific ocean',
       'north pacific ocean', 'federated states of micronesia',
       'mid atlantic ocean', 'british west indies',
       'south atlantic ocean', 'persian gulf', 'north sea', 'nicaragua',
       'maldive islands', 'american samoa', 'andaman', 'gabon', 'mayotte',
       'the balkans', 'argentina', 'martinique', 'indian ocean',
       'guatemala', 'netherlands antilles', 'northern mariana islands',
       'java', 'central pacific', 'southwest pacific ocean',
       'bay of bengal', 'mid-pacifc ocean', 'slovenia', 'curacao',
       'barbados', 'monaco', 'guyana', 'haiti', 'san domingo', 'ireland',
       'kuwait', 'libya', 'mediterranean sea', 'falkland islands',
       'crete', 'cyprus', 'burma', 'lebanon', 'paraguay', 'ocean',
       'georgia', 'syria', 'tuvalu', 'guinea', 'equatorial guinea',
       'cook islands', 'algeria', 'coast of africa', 'tasman sea',
       'ghana', 'st helena', 'greenland', 'sweden', 'iceland',
       'between portugal and india', 'djibouti', 'bahrein', 'korea',
       'asia', 'ceylon'], dtype=object)

Better now :)

In [32]:
df3.columns

Index(['Case Number', 'Date', 'Year', 'Type', 'Country', 'Area', 'Location',
       'Activity', 'Name', 'Sex', 'Age', 'Injury', 'Fatal', 'Time', 'Species',
       'Investigator or Source', 'ID'],
      dtype='object')

In [33]:
df3.head()

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Injury,Fatal,Time,Species,Investigator or Source,ID
0,2016.09.18.c,2016-09-18,2016,Unprovoked,united states,Florida,"New Smyrna Beach, Volusia County",Surfing,male,M,16,Minor injury to thigh,N,13h00,NaN,"Orlando Sentinel, 9/19/2016",5993
1,2016.09.18.b,2016-09-18,2016,Unprovoked,united states,Florida,"New Smyrna Beach, Volusia County",Surfing,Chucky Luciano,M,36,Lacerations to hands,N,11h00,NaN,"Orlando Sentinel, 9/19/2016",5992
2,2016.09.18.a,2016-09-18,2016,Unprovoked,united states,Florida,"New Smyrna Beach, Volusia County",Surfing,male,M,43,Lacerations to lower leg,N,10h43,NaN,"Orlando Sentinel, 9/19/2016",5991
3,2016.09.17,2016-09-17,2016,Unprovoked,australia,Victoria,Thirteenth Beach,Surfing,Rory Angiolella,M,NaN,Struck by fin on chest & leg,N,NaN,NaN,"The Age, 9/18/2016",5990
4,2016.09.15,2016-09-16,2016,Unprovoked,australia,Victoria,Bells Beach,Surfing,male,M,NaN,No injury: Knocked off board by shark,N,NaN,2 m shark,"The Age, 9/16/2016",5989

We still have non necessary columns. Drop!

In [34]:
df4 = df3.drop(columns=['Case Number', 'Name', 'Injury', 'Time', 'Species','Investigator or Source', 'ID'])

In [35]:
df4

,Date,Year,Type,Country,Area,Location,Activity,Sex,Age,Fatal
0,2016-09-18,2016,Unprovoked,united states,Florida,"New Smyrna Beach, Volusia County",Surfing,M,16,N
1,2016-09-18,2016,Unprovoked,united states,Florida,"New Smyrna Beach, Volusia County",Surfing,M,36,N
2,2016-09-18,2016,Unprovoked,united states,Florida,"New Smyrna Beach, Volusia County",Surfing,M,43,N
3,2016-09-17,2016,Unprovoked,australia,Victoria,Thirteenth Beach,Surfing,M,NaN,N
4,2016-09-16,2016,Unprovoked,australia,Victoria,Bells Beach,Surfing,M,NaN,N
...,...,...,...,...,...,...,...,...,...,...
5987,NaT,0,Unprovoked,australia,Western Australia,Roebuck Bay,Diving,M,NaN,Y
5988,NaT,0,Unprovoked,australia,Western Australia,NaN,Pearl diving,M,NaN,Y
5989,NaT,0,Unprovoked,united states,North Carolina,Ocracoke Inlet,Swimming,M,NaN,Y
5990,NaT,0,Unprovoked,panama,NaN,"Panama Bay 8ºN, 79ºW",NaN,M,NaN,Y
5991,NaT,0,Unprovoked,ceylon,Eastern Province,"Below the English fort, Trincomalee",Swimming,M,15,Y

The dataset is stil very messy. 
What else could we do?

In [36]:
df4.dtypes

Date        datetime64[ns]
Year                 int64
Type                object
Country             object
Area                object
Location            object
Activity            object
Sex                 object
Age                 object
Fatal               object
dtype: object

Transform the age into a number

In [37]:
df4["Age"] = np.where(df4["Age"].str.isdigit() == False, np.NaN, df4["Age"])

In [38]:
# Fill all Nans with 0 in order to make it int
df4["Age"] = df4["Age"].fillna(0).astype(int)

In [39]:
#Fill all 0 back zu NAN
df4["Age"] = np.where(df4["Age"] == 0, np.NaN, df4["Age"])

In [40]:
df4.head()

,Date,Year,Type,Country,Area,Location,Activity,Sex,Age,Fatal
0,2016-09-18,2016,Unprovoked,united states,Florida,"New Smyrna Beach, Volusia County",Surfing,M,16.0,N
1,2016-09-18,2016,Unprovoked,united states,Florida,"New Smyrna Beach, Volusia County",Surfing,M,36.0,N
2,2016-09-18,2016,Unprovoked,united states,Florida,"New Smyrna Beach, Volusia County",Surfing,M,43.0,N
3,2016-09-17,2016,Unprovoked,australia,Victoria,Thirteenth Beach,Surfing,M,NaN,N
4,2016-09-16,2016,Unprovoked,australia,Victoria,Bells Beach,Surfing,M,NaN,N

In [41]:
df4.dtypes

Date        datetime64[ns]
Year                 int64
Type                object
Country             object
Area                object
Location            object
Activity            object
Sex                 object
Age                float64
Fatal               object
dtype: object

In [42]:
df4["Type"].value_counts()

Unprovoked      4386
Provoked         557
Invalid          519
Sea Disaster     220
Boat             200
Boating          110
Name: Type, dtype: int64

In [43]:
df4[["Country", "Fatal"]].groupby("Country").count().sort_values("Fatal", ascending=False)

                         Fatal
Country
united states             2114
australia                 1278
south africa               565
papua new guinea           151
new zealand                124
...                        ...
grand cayman                 1
greenland                    1
palestinian territories      1
algeria                      1
iceland                      0

[173 rows x 1 columns]

# The USA are more dangerous than Australia! 
![jaws](images/jaws.jpg)

How it looks like at a microspatial level?

In [44]:
df4[["Area", "Country", "Fatal"]].groupby("Area").count().sort_values("Fatal", ascending=False) #how to show the Country name in the table below?

                      Country  Fatal
Area
Florida                   990    990
New South Wales           468    467
Queensland                300    300
Hawaii                    282    281
California                276    276
...                       ...    ...
Brindisi Province           1      0
Brittany                    1      0
Northern Peloponnese        1      0
Syracuse                    1      0
Ahirkapi coast              1      0

[785 rows x 2 columns]

In [45]:
df4.to_csv("data/Shark_Attacks_Clean.csv")